HomeAccountingMenagment/src/Documents/СписаниеТоваров/СписаниеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеТоваров</name>
  <registerRecords>AccumulationRegister.ПокупкиСписания</registerRecords>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

HomeAccountingMenagment/src/AccumulationRegisters/ПокупкиСписания/ПокупкиСписания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПокупкиСписания</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

HomeAccountingMenagment/src/Documents/СписаниеТоваров/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ПокупкиСписания
	Движения.ПокупкиСписания.Записывать = Истина;
	Для Каждого ТекСтрокаТовары из Товары Цикл
		Движение = Движения.ПокупкиСписания.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Товар = ТекСтрокаТовары.Товар;
		
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
		// Данный фрагмент построен конструктором.
		// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ПокупкиСписанияОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
			|	ПокупкиСписанияОстаткиИОбороты.КоличествоКонечныйОстаток
			|ИЗ
			|	РегистрНакопления.ПокупкиСписания.ОстаткиИОбороты(,,,, Товар.Наименование = &Наименование) КАК
			|		ПокупкиСписанияОстаткиИОбороты";
		
		Запрос.УстановитьПараметр("Наименование", ТекСтрокаТовары.Товар.Наименование);
		
		//@skip-check query-in-loop
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		СуммаОстатка =0;
		КоличествоОстатка = 0;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СуммаОстатка = СуммаОстатка + ВыборкаДетальныеЗаписи.СуммаКонечныйОстаток;
			КоличествоОстатка = КоличествоОстатка + ВыборкаДетальныеЗаписи.КоличествоКонечныйОстаток;
		КонецЦикла;

		Движение.Количество = ТекСтрокаТовары.Количество;
		
		Движения.Записать();
		//Провека остатков товара 
		
		Запрос = Новый	 Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		|	ПокупкиСписанияОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ПокупкиСписания.Остатки(, Товар.Наименование = &Наименование) КАК ПокупкиСписанияОстатки
		|ГДЕ
		|	ПокупкиСписанияОстатки.КоличествоОстаток < 0";
		
		Запрос.УстановитьПараметр("Наименование",ТекСтрокаТовары.Товар.Наименование);
		
		//@skip-check query-in-loop
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		//@skip-check query-in-loop
		Если Не Запрос.Выполнить().Пустой() Тогда 
			Отказ=Истина;
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Недостаточно количества товара для списания!";
			Сообщение.УстановитьДанные(ТекСтрокаТовары.Товар);
			Сообщение.Поле = "Наименование";
			Сообщение.Сообщить();
			
			Возврат;
		КонецЕсли;
		
		УсредненнаяЦенаЗаЕдТовара  = СуммаОстатка/КоличествоОстатка;
		Движение.Сумма = ТекСтрокаТовары.Количество * УсредненнаяЦенаЗаЕдТовара;
	КонецЦикла;


	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
